app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "test"], ["created_at", "2022-12-29 03:47:04.733311"], ["updated_at", "2022-12-29 03:47:04.733311"]]
---
  def create
    @post = Post.new(content: params[:content])
    respond_to do |format|
      if @post.save