app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?)  [["name", "テスト"], ["email", "test@mail.com"], ["created_at", "2022-12-22 11:58:40.791384"], ["updated_at", "2022-12-22 11:58:40.791384"], ["password", "test"]]
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password]
    )
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "test4<user>"], ["email", "test5<mail>"], ["updated_at", "2022-12-21 06:53:08.142635"], ["id", 5]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "test@mail.com"], ["password", "test"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:email], password: params[:password])